---
type: ExternalDataInstanceRemovingFromDocumentEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 2
tags: [revit-api, class]
---

# ExternalDataInstanceRemovingFromDocumentEventArgs

`Autodesk.Revit.DB.Events.ExternalDataInstanceRemovingFromDocumentEventArgs` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | InstanceId | 2023 | `public ElementId InstanceId { get ; }` |
| Property | TypeId | 2023 | `public ElementId TypeId { get ; }` |